dataset_gen/Reynolds_Variation/FPO_cylinder/Multiple_Hole_inter/Design_Point_0/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
convertToMeters 1;

vertices
(
    (0 0 0)
    (0.625 0 0)
    (0.75 0 0)
    (1.25 0 0)
    (1.375 0 0)
    (2 0 0)
    (0 0.9375 0)
    (0.625 0.9375 0)
    (0.75 0.9375 0)
    (1.25 0.9375 0)
    (1.375 0.9375 0)
    (2 0.9375 0)
    (0 1.0625 0)
    (0.625 1.0625 0)
    (0.75 1.0625 0)
    (1.25 1.0625 0)
    (1.375 1.0625 0)
    (2 1.0625 0)
    (0 2 0)
    (0.625 2 0)
    (0.75 2 0)
    (1.25 2 0)
    (1.375 2 0)
    (2 2 0)
    (0 0 0.1)
    (0.625 0 0.1)
    (0.75 0 0.1)
    (1.25 0 0.1)
    (1.375 0 0.1)
    (2 0 0.1)
    (0 0.9375 0.1)
    (0.625 0.9375 0.1)
    (0.75 0.9375 0.1)
    (1.25 0.9375 0.1)
    (1.375 0.9375 0.1)
    (2 0.9375 0.1)
    (0 1.0625 0.1)
    (0.625 1.0625 0.1)
    (0.75 1.0625 0.1)
    (1.25 1.0625 0.1)
    (1.375 1.0625 0.1)
    (2 1.0625 0.1)
    (0 2 0.1)
    (0.625 2 0.1)
    (0.75 2 0.1)
    (1.25 2 0.1)
    (1.375 2 0.1)
    (2 2 0.1)
);

blocks
(
    hex (0 1 7 6 24 25 31 30) (40 60 1) simpleGrading (1 1 1)
    hex (1 2 8 7 25 26 32 31) (8 60 1) simpleGrading (1 1 1)
    hex (2 3 9 8 26 27 33 32) (32 60 1) simpleGrading (1 1 1)
    hex (3 4 10 9 27 28 34 33) (8 60 1) simpleGrading (1 1 1)
    hex (4 5 11 10 28 29 35 34) (40 60 1) simpleGrading (1 1 1)
    hex (6 7 13 12 30 31 37 36) (40 8 1) simpleGrading (1 1 1)
    hex (8 9 15 14 32 33 39 38) (32 8 1) simpleGrading (1 1 1)
    hex (10 11 17 16 34 35 41 40) (40 8 1) simpleGrading (1 1 1)
    hex (12 13 19 18 36 37 43 42) (40 60 1) simpleGrading (1 1 1)
    hex (13 14 20 19 37 38 44 43) (8 60 1) simpleGrading (1 1 1)
    hex (14 15 21 20 38 39 45 44) (32 60 1) simpleGrading (1 1 1)
    hex (15 16 22 21 39 40 46 45) (8 60 1) simpleGrading (1 1 1)
    hex (16 17 23 22 40 41 47 46) (40 60 1) simpleGrading (1 1 1)
);

boundary
(
    left
    {
        type    patch;
        faces
        (
            (0 6 30 24)
            (6 12 36 30)
            (12 18 42 36)
        );
    }
    right
    {
        type    patch;
        faces
        (
            (5 11 35 29)
            (11 17 41 35)
            (17 23 47 41)
        );
    }
    bottom
    {
        type    wall;
        faces
        (
            (0 1 25 24)
            (1 2 26 25)
            (2 3 27 26)
            (3 4 28 27)
            (4 5 29 28)
        );
    }
    top
    {
        type    wall;
        faces
        (
            (18 19 43 42)
            (19 20 44 43)
            (20 21 45 44)
            (21 22 46 45)
            (22 23 47 46)
        );
    }
    frontAndBack
    {
        type    empty;
        faces
        (
            (0 1 7 6)
            (24 25 31 30)
            (1 2 8 7)
            (25 26 32 31)
            (2 3 9 8)
            (26 27 33 32)
            (3 4 10 9)
            (27 28 34 33)
            (4 5 11 10)
            (28 29 35 34)
            (6 7 13 12)
            (30 31 37 36)
            (8 9 15 14)
            (32 33 39 38)
            (10 11 17 16)
            (34 35 41 40)
            (12 13 19 18)
            (36 37 43 42)
            (13 14 20 19)
            (37 38 44 43)
            (14 15 21 20)
            (38 39 45 44)
            (15 16 22 21)
            (39 40 46 45)
            (16 17 23 22)
            (40 41 47 46)
        );
    }
    hole1
    {
        type    wall;
        faces
        (
            (7 13 37 31)
            (8 14 38 32)
            (7 8 32 31)
            (13 14 38 37)
        );
    }
    hole2
    {
        type    wall;
        faces
        (
            (9 15 39 33)
            (10 16 40 34)
            (9 10 34 33)
            (15 16 40 39)
        );
    }
);

mergePatchPairs
(
);
